[
    {
        "id": 0,
        "title": "Pit Operations Manager",
        "imageSource": "/src/assets/images/compressed_pit_manager.png",
        "details": [
            "Develop and maintain web applications using modern frameworks and technologies.",
            "Collaborate with cross-functional teams to define, design, and ship new features.",
            "Write clean, maintainable, and efficient code."
        ],
        "company": "Stevens Custom Crushing & Gravel LLC",
        "location": "Great Falls, MT",
        "description": "The Pit Operations Manager is responsible for performing the following duties related to overseeing all aspects of the daily operations of the gravel pit: Supervise and schedule pit operations to meet production goals while minimizing equipment downtime. Keep detailed records of equipment issues, repairs, and warranty claims. Coordinate with manufacturers and service providers to manage warranty work and ensure equipment is serviced properly. Oversee the repair and maintenance of crushing and mobile equipment to maximize uptime and operational efficiency. Manage any urgent or breakdown jobs as required to keep equipment running an minimize downtime. Lead the technical troubleshooting efforts to identify and resolve equipment issues in a timely manner. Utilize manufacturing contacts to expedite troubleshooting and delivery of parts for warranty and non-warranty repairs. Complete preventative maintenance and daily inspections to ensure proper operation of equipment. Set up mobile crushing equipment in different configurations to meet the desired product needs and site limitations and goals. Ensure gravel pit and mobile sites operate safely, efficiently, and successfully by meeting MSHA and local safety requirements. Ensure product quality meets the required material specifications. Supervise 1 - 2 subcontracted equipment operators.",
        "requirements": [
            "36 months of experience with all job duties"
        ],
        "attention": "Zack Stevens, PO Box 1448, Great Falls MT 59403",
        "postedDate": "12/09/2025"
    }
]